# Gold Rate Puzzle

Source: https://msbiskills.com/2015/03/22/t-sql-query-gold-rate-puzzle/

In the puzzle we have gold rate changing all the time. We have to find the start date, end Date and the gold rate at that duration. If the gold rate is changed then only we have create a new row. Please check the sample input and the expected output.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `rates` table

In [3]:
%%sql

DROP TABLE IF EXISTS rates;
CREATE TABLE rates (
    dt   DATE  NOT NULL PRIMARY KEY,
    rate INT  NOT NULL
);

INSERT INTO rates
VALUES 
    (to_date('18-09-2014', 'DD-MM-YYYY'), 27000),
    (to_date('19-09-2014', 'DD-MM-YYYY'), 27000),
    (to_date('20-09-2014', 'DD-MM-YYYY'), 31000),
    (to_date('21-09-2014', 'DD-MM-YYYY'), 31000),
    (to_date('22-09-2014', 'DD-MM-YYYY'), 31000),
    (to_date('23-09-2014', 'DD-MM-YYYY'), 32000),
    (to_date('24-09-2014', 'DD-MM-YYYY'), 31000),
    (to_date('25-09-2014', 'DD-MM-YYYY'), 32000),
    (to_date('26-09-2014', 'DD-MM-YYYY'), 27000);

SELECT * FROM rates;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(datetime.date(2014, 9, 18), 27000),
 (datetime.date(2014, 9, 19), 27000),
 (datetime.date(2014, 9, 20), 31000),
 (datetime.date(2014, 9, 21), 31000),
 (datetime.date(2014, 9, 22), 31000),
 (datetime.date(2014, 9, 23), 32000),
 (datetime.date(2014, 9, 24), 31000),
 (datetime.date(2014, 9, 25), 32000),
 (datetime.date(2014, 9, 26), 27000)]

## The expected output

|StartDate |EndDate   |Rate |
|---       |---       |---  |
|2014-09-18|2014-09-19|27000|
|2014-09-20|2014-09-22|31000|
|2014-09-23|2014-09-23|32000|
|2014-09-24|2014-09-24|31000|
|2014-09-25|2014-09-25|32000|
|2014-09-26|2014-09-26|27000|

# Type your SQL below

In [1]:
# %%sql
#
# Type your query here